###############################################################################
# Created by write_sdc
# Fri Sep  2 20:16:30 2022
###############################################################################
current_design pixel
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {adj_max_clk[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {adj_max_clk[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {adj_max_clk[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {adj_max_clk[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {adj_max_clk[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {adj_max_clk[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {adj_max_clk[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {adj_max_clk[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {adj_max_clk[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {adj_max_clk[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {adj_timer_m_i}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {loc_max_clk[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {loc_max_clk[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {loc_max_clk[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {loc_max_clk[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {loc_max_clk[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {loc_max_clk[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {loc_max_clk[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {loc_max_clk[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {loc_max_clk[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {loc_max_clk[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {loc_timer_m_i}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pxl_done_i}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pxl_start_i}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reset}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {adj_timer_en}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {adj_timer_max}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_sel[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_sel[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_sel[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_sel[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {kernel_done_o}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {loc_timer_en}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {loc_timer_max}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pxl_done_o}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pxl_q[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pxl_q[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pxl_q[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pxl_q[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s1}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s1_inv}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s2}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s2_inv}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_p1}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_p2}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {v_b0}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {v_b1}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {adj_timer_en}]
set_load -pin_load 0.0334 [get_ports {adj_timer_max}]
set_load -pin_load 0.0334 [get_ports {kernel_done_o}]
set_load -pin_load 0.0334 [get_ports {loc_timer_en}]
set_load -pin_load 0.0334 [get_ports {loc_timer_max}]
set_load -pin_load 0.0334 [get_ports {pxl_done_o}]
set_load -pin_load 0.0334 [get_ports {s1}]
set_load -pin_load 0.0334 [get_ports {s1_inv}]
set_load -pin_load 0.0334 [get_ports {s2}]
set_load -pin_load 0.0334 [get_ports {s2_inv}]
set_load -pin_load 0.0334 [get_ports {s_p1}]
set_load -pin_load 0.0334 [get_ports {s_p2}]
set_load -pin_load 0.0334 [get_ports {v_b0}]
set_load -pin_load 0.0334 [get_ports {v_b1}]
set_load -pin_load 0.0334 [get_ports {data_out[15]}]
set_load -pin_load 0.0334 [get_ports {data_out[14]}]
set_load -pin_load 0.0334 [get_ports {data_out[13]}]
set_load -pin_load 0.0334 [get_ports {data_out[12]}]
set_load -pin_load 0.0334 [get_ports {data_out[11]}]
set_load -pin_load 0.0334 [get_ports {data_out[10]}]
set_load -pin_load 0.0334 [get_ports {data_out[9]}]
set_load -pin_load 0.0334 [get_ports {data_out[8]}]
set_load -pin_load 0.0334 [get_ports {data_out[7]}]
set_load -pin_load 0.0334 [get_ports {data_out[6]}]
set_load -pin_load 0.0334 [get_ports {data_out[5]}]
set_load -pin_load 0.0334 [get_ports {data_out[4]}]
set_load -pin_load 0.0334 [get_ports {data_out[3]}]
set_load -pin_load 0.0334 [get_ports {data_out[2]}]
set_load -pin_load 0.0334 [get_ports {data_out[1]}]
set_load -pin_load 0.0334 [get_ports {data_out[0]}]
set_load -pin_load 0.0334 [get_ports {data_sel[3]}]
set_load -pin_load 0.0334 [get_ports {data_sel[2]}]
set_load -pin_load 0.0334 [get_ports {data_sel[1]}]
set_load -pin_load 0.0334 [get_ports {data_sel[0]}]
set_load -pin_load 0.0334 [get_ports {pxl_q[3]}]
set_load -pin_load 0.0334 [get_ports {pxl_q[2]}]
set_load -pin_load 0.0334 [get_ports {pxl_q[1]}]
set_load -pin_load 0.0334 [get_ports {pxl_q[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {adj_timer_m_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {loc_timer_m_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pxl_done_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pxl_start_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reset}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {adj_max_clk[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {adj_max_clk[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {adj_max_clk[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {adj_max_clk[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {adj_max_clk[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {adj_max_clk[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {adj_max_clk[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {adj_max_clk[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {adj_max_clk[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {adj_max_clk[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {loc_max_clk[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {loc_max_clk[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {loc_max_clk[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {loc_max_clk[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {loc_max_clk[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {loc_max_clk[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {loc_max_clk[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {loc_max_clk[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {loc_max_clk[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {loc_max_clk[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
